In [1]:
import pandas as pd

### Function to add 12 records (rows) based on user input

In [2]:
def add_records():
    records = []
    for i in range(12):
        prod_no = input("Enter Product No: ")
        prod_name = input("Enter Product Name: ")
        jan = int(input("Enter January Sell: "))
        feb = int(input("Enter February Sell: "))
        mar = int(input("Enter March Sell: "))
        apr = int(input("Enter April Sell: "))
        may = int(input("Enter May Sell: "))
        jun = int(input("Enter June Sell: "))
        records.append([prod_no, prod_name, jan, feb, mar, apr, may, jun])
    return records

### 1. Add 12 Records

In [3]:
data = add_records()

Enter Product No: 1
Enter Product Name: pen
Enter January Sell: 1200
Enter February Sell: 1300
Enter March Sell: 1400
Enter April Sell: 1600
Enter May Sell: 1800
Enter June Sell: 1900
Enter Product No: 2
Enter Product Name: pencil
Enter January Sell: 1000
Enter February Sell: 1200
Enter March Sell: 1300
Enter April Sell: 1400
Enter May Sell: 1600
Enter June Sell: 1800
Enter Product No: 3
Enter Product Name: page
Enter January Sell: 1100
Enter February Sell: 1250
Enter March Sell: 1600
Enter April Sell: 1200
Enter May Sell: 1400
Enter June Sell: 1500
Enter Product No: 4
Enter Product Name: eraser
Enter January Sell: 1150
Enter February Sell: 1200
Enter March Sell: 1400
Enter April Sell: 1500
Enter May Sell: 1800
Enter June Sell: 1900
Enter Product No: 5
Enter Product Name: notebook
Enter January Sell: 1200
Enter February Sell: 1400
Enter March Sell: 1500
Enter April Sell: 1700
Enter May Sell: 2000
Enter June Sell: 2500
Enter Product No: 6
Enter Product Name: shoes
Enter January Sell: 1200
Enter February Sell: 1500
Enter March Sell: 1600
Enter April Sell: 1800
Enter May Sell: 2000
Enter June Sell: 2500
Enter Product No: 7
Enter Product Name: bag
Enter January Sell: 1000
Enter February Sell: 1150
Enter March Sell: 1200
Enter April Sell: 1250
Enter May Sell: 1300
Enter June Sell: 1350
Enter Product No: 8
Enter Product Name: watch
Enter January Sell: 1200
Enter February Sell: 1400
Enter March Sell: 1500
Enter April Sell: 1600
Enter May Sell: 1800
Enter June Sell: 2000
Enter Product No: 9
Enter Product Name: nailpolish
Enter January Sell: 1000
Enter February Sell: 1100
Enter March Sell: 1400
Enter April Sell: 1600
Enter May Sell: 1700
Enter June Sell: 1800
Enter Product No: 10
Enter Product Name: apple
Enter January Sell: 1200
Enter February Sell: 1400
Enter March Sell: 1500
Enter April Sell: 1600
Enter May Sell: 1700
Enter June Sell: 1800
Enter Product No: 11
Enter Product Name: pineapple
Enter January Sell: 1000
Enter February Sell: 1200
Enter March Sell: 1400
Enter April Sell: 1500
Enter May Sell: 1800
Enter June Sell: 2000
Enter Product No: 12
Enter Product Name: belt
Enter January Sell: 1000
Enter February Sell: 1200
Enter March Sell: 1500
Enter April Sell: 1800
Enter May Sell: 1900
Enter June Sell: 2000

### 2. Create DataFrame

In [4]:
columns = ["Prod_No", "Prod_Name", "January", "February", "March", "April", "May", "June"]
df = pd.DataFrame(data, columns=columns)

### 3. Change Column Names

In [5]:
df = df.rename(columns={"Prod_No": "Product No", "Prod_Name": "Product Name"})

### 4. Add "Total Sell" and "Average Sell" columns

In [6]:
df["Total Sell"] = df.iloc[:, 2:].sum(axis=1)
df["Average Sell"] = df.iloc[:, 2:8].mean(axis=1)

### 5. Add 2 rows at the end

In [7]:
df = pd.concat([df, pd.DataFrame([["13", "mango", 1000, 2000, 3000, 4000, 5000, 6000],
                                   ["14", "bananas", 700, 800, 900, 1000, 1100, 1200]], columns=columns)], ignore_index=True)

### 6. Add 2 rows after the 3rd row

In [8]:
insert_row1 = {"Product No": "15", "Product Name": "pomegranate", "January": 8000, "February": 9000, "March": 10000, "April": 11000, "May": 12000, "June": 13000}
insert_row2 = {"Product No": "16", "Product Name": "coconut", "January": 9000, "February": 10000, "March": 11000, "April": 12000, "May": 13000, "June": 14000}
df = pd.concat([df.iloc[:3], pd.DataFrame([insert_row1, insert_row2]), df.iloc[3:]]).reset_index(drop=True)

### 7. Print first 5 rows

In [9]:
print("First 5 rows:")
print(df.head(5))

First 5 rows:
  Product No Product Name  January  February  March  April    May   June  \
0          1          pen     1200      1300   1400   1600   1800   1900
1          2       pencil     1000      1200   1300   1400   1600   1800
2          3         page     1100      1250   1600   1200   1400   1500
3         15  pomegranate     8000      9000  10000  11000  12000  13000
4         16      coconut     9000     10000  11000  12000  13000  14000

   Total Sell  Average Sell Prod_No Prod_Name
0      9200.0   1533.333333     NaN       NaN
1      8300.0   1383.333333     NaN       NaN
2      8050.0   1341.666667     NaN       NaN
3         NaN           NaN     NaN       NaN
4         NaN           NaN     NaN       NaN

### 8. Print last 5 rows

In [10]:
print("\nLast 5 rows:")
print(df.tail(5))

Last 5 rows:
   Product No Product Name  January  February  March  April   May  June  \
11         10        apple     1200      1400   1500   1600  1700  1800
12         11    pineapple     1000      1200   1400   1500  1800  2000
13         12         belt     1000      1200   1500   1800  1900  2000
14        NaN          NaN     1000      2000   3000   4000  5000  6000
15        NaN          NaN      700       800    900   1000  1100  1200

    Total Sell  Average Sell Prod_No Prod_Name
11      9200.0   1533.333333     NaN       NaN
12      8900.0   1483.333333     NaN       NaN
13      9400.0   1566.666667     NaN       NaN
14         NaN           NaN      13     mango
15         NaN           NaN      14   bananas

### 9. Print rows 6 to 10

In [11]:
print("\nRows 6 to 10:")
print(df.iloc[5:10])

Rows 6 to 10:
  Product No Product Name  January  February  March  April   May  June  \
5          4       eraser     1150      1200   1400   1500  1800  1900
6          5     notebook     1200      1400   1500   1700  2000  2500
7          6        shoes     1200      1500   1600   1800  2000  2500
8          7          bag     1000      1150   1200   1250  1300  1350
9          8        watch     1200      1400   1500   1600  1800  2000

   Total Sell  Average Sell Prod_No Prod_Name
5      8950.0   1491.666667     NaN       NaN
6     10300.0   1716.666667     NaN       NaN
7     10600.0   1766.666667     NaN       NaN
8      7250.0   1208.333333     NaN       NaN
9      9500.0   1583.333333     NaN       NaN

### 10. Print only product names

In [12]:
print("\nProduct Names:")
print(df["Product Name"])

Product Names:
0             pen
1          pencil
2            page
3     pomegranate
4         coconut
5          eraser
6        notebook
7           shoes
8             bag
9           watch
10     nailpolish
11          apple
12      pineapple
13           belt
14            NaN
15            NaN
Name: Product Name, dtype: object

### 11. Print January sell with product ID and product name

In [13]:
print("\nJanuary Sell with Product ID and Product Name:")
print(df[["Product No", "Product Name", "January"]])

January Sell with Product ID and Product Name:
   Product No Product Name  January
0           1          pen     1200
1           2       pencil     1000
2           3         page     1100
3          15  pomegranate     8000
4          16      coconut     9000
5           4       eraser     1150
6           5     notebook     1200
7           6        shoes     1200
8           7          bag     1000
9           8        watch     1200
10          9   nailpolish     1000
11         10        apple     1200
12         11    pineapple     1000
13         12         belt     1000
14        NaN          NaN     1000
15        NaN          NaN      700

### 12. Print records where January sell > 5000 and February sell > 8000

In [14]:
print("\nRecords where January sell > 5000 and February sell > 8000:")
print(df[(df["January"] > 5000) & (df["February"] > 8000)])

Records where January sell > 5000 and February sell > 8000:
  Product No Product Name  January  February  March  April    May   June  \
3         15  pomegranate     8000      9000  10000  11000  12000  13000
4         16      coconut     9000     10000  11000  12000  13000  14000

   Total Sell  Average Sell Prod_No Prod_Name
3         NaN           NaN     NaN       NaN
4         NaN           NaN     NaN       NaN

### 13. Print records in sorting order of Product name

In [15]:
print("\nRecords sorted by Product Name:")
print(df.sort_values(by="Product Name"))

Records sorted by Product Name:
   Product No Product Name  January  February  March  April    May   June  \
11         10        apple     1200      1400   1500   1600   1700   1800
8           7          bag     1000      1150   1200   1250   1300   1350
13         12         belt     1000      1200   1500   1800   1900   2000
4          16      coconut     9000     10000  11000  12000  13000  14000
5           4       eraser     1150      1200   1400   1500   1800   1900
10          9   nailpolish     1000      1100   1400   1600   1700   1800
6           5     notebook     1200      1400   1500   1700   2000   2500
2           3         page     1100      1250   1600   1200   1400   1500
0           1          pen     1200      1300   1400   1600   1800   1900
1           2       pencil     1000      1200   1300   1400   1600   1800
12         11    pineapple     1000      1200   1400   1500   1800   2000
3          15  pomegranate     8000      9000  10000  11000  12000  13000
7           6        shoes     1200      1500   1600   1800   2000   2500
9           8        watch     1200      1400   1500   1600   1800   2000
14        NaN          NaN     1000      2000   3000   4000   5000   6000
15        NaN          NaN      700       800    900   1000   1100   1200

    Total Sell  Average Sell Prod_No Prod_Name
11      9200.0   1533.333333     NaN       NaN
8       7250.0   1208.333333     NaN       NaN
13      9400.0   1566.666667     NaN       NaN
4          NaN           NaN     NaN       NaN
5       8950.0   1491.666667     NaN       NaN
10      8600.0   1433.333333     NaN       NaN
6      10300.0   1716.666667     NaN       NaN
2       8050.0   1341.666667     NaN       NaN
0       9200.0   1533.333333     NaN       NaN
1       8300.0   1383.333333     NaN       NaN
12      8900.0   1483.333333     NaN       NaN
3          NaN           NaN     NaN       NaN
7      10600.0   1766.666667     NaN       NaN
9       9500.0   1583.333333     NaN       NaN
14         NaN           NaN      13     mango
15         NaN           NaN      14   bananas

### 14. Display only odd index number column records

In [16]:
print("\nOdd Index Column Records:")
print(df.iloc[:, 1::2])

Odd Index Column Records:
   Product Name  February  April   June  Average Sell Prod_Name
0           pen      1300   1600   1900   1533.333333       NaN
1        pencil      1200   1400   1800   1383.333333       NaN
2          page      1250   1200   1500   1341.666667       NaN
3   pomegranate      9000  11000  13000           NaN       NaN
4       coconut     10000  12000  14000           NaN       NaN
5        eraser      1200   1500   1900   1491.666667       NaN
6      notebook      1400   1700   2500   1716.666667       NaN
7         shoes      1500   1800   2500   1766.666667       NaN
8           bag      1150   1250   1350   1208.333333       NaN
9         watch      1400   1600   2000   1583.333333       NaN
10   nailpolish      1100   1600   1800   1433.333333       NaN
11        apple      1400   1600   1800   1533.333333       NaN
12    pineapple      1200   1500   2000   1483.333333       NaN
13         belt      1200   1800   2000   1566.666667       NaN
14          NaN      2000   4000   6000           NaN     mango
15          NaN       800   1000   1200           NaN   bananas

### 15. Display alternate rows

In [17]:
print("\nAlternate Rows:")
print(df.iloc[::2])

Alternate Rows:
   Product No Product Name  January  February  March  April    May   June  \
0           1          pen     1200      1300   1400   1600   1800   1900
2           3         page     1100      1250   1600   1200   1400   1500
4          16      coconut     9000     10000  11000  12000  13000  14000
6           5     notebook     1200      1400   1500   1700   2000   2500
8           7          bag     1000      1150   1200   1250   1300   1350
10          9   nailpolish     1000      1100   1400   1600   1700   1800
12         11    pineapple     1000      1200   1400   1500   1800   2000
14        NaN          NaN     1000      2000   3000   4000   5000   6000

    Total Sell  Average Sell Prod_No Prod_Name
0       9200.0   1533.333333     NaN       NaN
2       8050.0   1341.666667     NaN       NaN
4          NaN           NaN     NaN       NaN
6      10300.0   1716.666667     NaN       NaN
8       7250.0   1208.333333     NaN       NaN
10      8600.0   1433.333333     NaN       NaN
12      8900.0   1483.333333     NaN       NaN
14         NaN           NaN      13     mango